DO1FJN/C2LORAGW/sdkconfig.defaults.tdeck
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="parttables/PartTable08MiB.csv"
CONFIG_TARGET_LILYGO_TDECK=y
CONFIG_LOCALAUDIO_ENABLED=y
CONFIG_LOCAL_PTT_ENABLED=y
CONFIG_LOW_FREQUENCY_RANGE_MHZ=420
CONFIG_HIGH_FREQUENCY_RANGE_MHZ=450
CONFIG_DEFAULT_CALLSIGN="C2LORA"
CONFIG_PARSE_INI_DEBUG=y
CONFIG_DEVICE_NAME="C2LoraTDeck"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=9216
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_PANIC_HANDLER_IRAM=y
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LWIP_LOCAL_HOSTNAME="TDeck"
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_UDP_RECVMBOX_SIZE=8
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=10240
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
